docs/posts/2015-01-13-the-sixteenth-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 26, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Sixteenth Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Sixteenth Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
As I was driving to work this morning, the person behind me honked as I was waiting for a pedestrian to cross the street at a marked crosswalk. I was still fuming and telling myself that I wish I could have told them what I really thought as they pulled into the parking space beside me. Fortunately, I had just heard Mitch Randall&rsquo;s sermon on Daniel in the lions&rsquo; den the day before. With that said, here is the prayer for the week:
</p>

<p>
Lord,
</p>

<p>
It seems like I&rsquo;m always in the lions&rsquo; den.
</p>

<p>
I tell myself that I&rsquo;m Daniel,<br>
a man of faith who was slandered by the envious,<br>
the righteous one who was unjustly attacked by his enemies.
</p>

<p>
I can fool myself, Lord,<br>
but surely I&rsquo;m not fooling you.
</p>

<p>
Most of the time,<br>
I&rsquo;m one of the lions.<br>
Ready at any time to open my mouth<br>
to tear down,<br>
to hurt,<br>
to wound,<br>
to destroy.
</p>

<p>
And when I lack the ability to shut my own mouth,<br>
please shut it for me,<br>
until it&rsquo;s filled with words<br>
that proclaim<br>
justice,<br>
healing,<br>
mercy,<br>
and love.
</p>

<p>
Then, loosen my lips,<br>
so that the stream of mercy and love<br>
can flow from you, through me,<br>
and transform the lions&rsquo; den<br>
into a sanctuary of your grace.
</p>

<p>
<i>Amen</i>
</p>




<div class="tagline" id="org26e755a">
<p>
Tagged: prayer
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 26, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
